---
type: TriOrQuadFacet
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# TriOrQuadFacet

`Autodesk.Revit.DB.TriOrQuadFacet` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetVertexIndex | 2013 | `public int GetVertexIndex ( int index )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Normal | 2013 | `public XYZ Normal { get ; }` |
| Property | NumberOfVertices | 2013 | `public int NumberOfVertices { get ; }` |